// 0. Напишите программу, которая на вход принимает
// число и выдает его квадрат (число умноженное на само себя).

Console.WriteLine("write a number: ");

int num = int.Parse(Console.ReadLine());
Console.WriteLine(num*num);